
//四川
data1=[[['口腔医学',8],['中国语言文学',7],['马克思主义理论',6],['数学',6],['化学',6],['生物学',6],['材料科学与工程',6],['化学工程与技术',6]],
    [['畜牧学',6],['作物学（自定）',5],['风景园林学',4],['农业资源与环境',4],['兽医学',4],['林学',4],['草学',4],['生物学',3]],
    [['交通运输工程',8],['土木工程',6],['马克思主义理论',5],['机械工程',5],['电气工程',5],['信息与通信工程',5],['计算机科学与技术',5],['管理科学与工程',5]],
    [['电子科学与技术',8],['信息与通信工程',8],['计算机科学与技术',7],['光学工程',6],['仪器科学与技术',5],['生物医学工程',5],['软件工程',5],['管理科学与工程',5]],
    [['应用经济学（自定）',6],['工商管理',6],['理论经济学',5],['法学',4],['马克思主义理论',3],['公共管理',3],['社会学',2],['管理科学与工程',2]]
       ]

//北京
data1=[[['系统科学',8],['信息与通信工程',6],['计算机科学与技术',6],['交通运输工程',6],['工商管理',6],['应用经济学',5],['马克思主义理论',5],['统计学',5]],
    [['农业工程',8],['食品科学与工程',8],['作物学',8],['畜牧学',8],['兽医学',8],['草学',8],['生物学',8],['农业资源与环境',7]],
    [['电子科学与技术',8],['信息与通信工程',8],['计算机科学与技术',7],['光学工程',6],['仪器科学与技术',5],['生物医学工程',5],['软件工程',5],['管理科学与工程',5]],
    [['外国语言文学',8],['政治学',3],['法学',2],['中国语言文学',2],['新闻传播学',2],['管理科学与工程',2],['暂无',0],['暂无',0]],
    [['兵器科学与技术',],['机械工程',],['控制科学与工程',],['光学工程',],['材料科学与工程',],['信息与通信工程',],['计算机科学与技术',],['化学工程与技术',]],
    [['风景园林学',8],['林学',8],['生物学',4],['生态学',4],['林业工程',4],['农林经济管理',4],['环境科学与工程',3],['机械工程',2]],
    [['土木工程',7],['环境科学与工程',6],['统计学',5],['机械工程',5],['光学工程',5],['材料科学与工程',5],['控制科学与工程',5],['计算机科学与技术',5]]
    [['教育学',8],['心理学',8],['中国语言文学',8],['中国史',8],['地理学',8],['戏剧与影视学',8],['数学',7],['环境科学与工程',7]],
    [['体育学',8],['心理学',1],['暂无',0],['暂无',0],['暂无',0],['暂无',0],['暂无',0],['暂无',0]],
    [['仪器科学与技术',8],['材料科学与工程',8],['航空宇航科学与技术',8],['软件工程',8],['控制科学与工程',7],['计算机科学与技术',7],['管理科学与工程',7],['外国语言文学',6]],
    [['中医学',8],['中西医结合',8],['中药学',5],['暂无',0],['暂无',0],['暂无',0],['暂无',0],['暂无',0]],
    [['音乐与舞蹈学',8],['暂无',0],['暂无',0],['暂无',0],['暂无',0],['暂无',0],['暂无',0],['暂无',0]],
    [['新闻传播学',8],['戏剧与影视学',8],['艺术学理论',6],['设计学',5],['信息与通信工程',4],['音乐与舞蹈学',4],['美术学',4],['中国语言文学',3]],
    [['应用经济学',8],['工商管理',6],['理论经济学',5],['马克思主义理论',5],['统计学',5],['法学',4],['公共管理',4],['社会学',3]],
    //--------
    [['地质学',8],['地质资源与地质工程',8],['环境科学与工程',5],['公共管理',5],['马克思主义理论',4],['海洋科学',4],['计算机科学与技术',4],['土木工程',4]],
    [['矿业工程',8],['安全科学与工程',8],['测绘科学与技术',6],['地质资源与地质工程',6],['机械工程',5],['土木工程',5],['化学工程与技术',5],['管理科学与工程',5]],
    [['地质资源与地质工程',8],['石油与天然气工程',8],['化学工程与技术',6],['安全科学与工程',5],['马克思主义理论',4],['机械工程',4],['动力工程及工程热物理',5],['管理科学与工程',5]],
    [['法学',8],['政治学',5],['马克思主义理论',4],['社会学',3],['哲学',2],['理论经济学',2],['外国语言文学',2],['新闻传播学',1]],
    [['化学工程与技术',7],['材料科学与工程',6],['化学',5],['控制科学与工程',5],['环境科学与工程',4],['机械工程',3],['计算机科学与技术',2],['安全科学与工程',2]],
    [['民族学',8],['社会学',5],['中国语言文学',5],['哲学',4],['音乐与舞蹈学',4],['美术学',4],['法学',3],['中国史',3]],
    [['电气工程（自定）',7],['动力工程及工程热物理',6],['管理科学与工程',5],['工商管理',5],['控制科学与工程',4],['计算机科学与技术',3],['环境科学与工程',3],['软件工程',3]],
    [['哲学',8],['数学',8],['物理学',8],['化学',8],['计算机科学与技术',8],['中国语言文学',8],['政治学',8],['外国语言文学',8]],
    [['基础医学',8],['药学',8],['临床医学',7],['护理学',6],['公共卫生与预防医学',4],['中医学',3],['中西医结合',2],['图书情报与档案管理',1]],
    [['理论经济学',8],['应用经济学',8],['法学',8],['社会学',8],['马克思主义理论',8],['新闻传播学',8],['统计学',8],['工商管理',8]],
    [['计算机科学与技术',8],['机械工程',8],['化学',8],['力学',8],['动力工程及工程热物理',8],['电气工程',8],['建筑学',8],['核科学与技术',8]],
    [['科学技术史',8],['冶金工程',8],['材料科学与工程',7],['机械工程',5],['控制科学与工程',5],['计算机科学与技术',5],['矿业工程',5],['环境科学与工程',5]],
    [['应用经济学',7],['工商管理',7],['法学',6],['外国语言文学',6],['统计学',5],['理论经济学',4],['政治学',4],['公共管理',4]],
    [['马克思主义理论',6],['教育学',6],['中国语言文学',6],['世界史',6],['美术学',6],['中国史',5],['数学',5],['地理学',5]]
    // [['',],['',],['',],['',],['',],['',],['',],['',]],
    // [['',],['',],['',],['',],['',],['',],['',],['',]],
       ]

//黑龙江
data1=[[['机械工程',8],['控制科学与工程',8],['环境科学与工程',8],['力学',7],['材料科学与工程',7],['计算机科学与技术',7],['土木工程',7],['管理科学与工程',7]],
    [['林业工程',8],['风景园林学',5],['林学',5],['生物学',4],['生态学',4],['农林经济管理',4],['马克思主义理论',3],['机械工程',3]],
    [['船舶与海洋工程',8],['控制科学与工程',6],['动力工程及工程热物理',5],['信息与通信工程',5],['计算机科学与技术',5],['核科学与技术',5],['管理科学与工程',5],['马克思主义理论',4]]

]

//青海
data1=[
    [['草学',3],['作物学',2],['临床医学',1],['暂无',0],['暂无',0],['暂无',0],['暂无',0],['暂无',0]]
]

//陕西
data1=[
    [['航空宇航科学与技术',8],['材料科学与工程',7],['计算机科学与技术',6],['力学',5],['机械工程',5],['电子科学与技术',5],['控制科学与工程',5],['软件工程',5]],
    [['林学',6],['生物学',5],['生态学',5],['农业工程',5],['食品科学与工程',5],['作物学',5],['园艺学',5],['农业资源与环境',5]],
    [['动力工程及工程热物理',8],['电气工程',8],['数学',7],['力学',7],['机械工程',7],['工商管理',7],['应用经济学',6],['马克思主义理论',6]],
    [['考古学',8],['理论经济学',6],['世界史',5],['化学',5],['地质学',5],['化学工程与技术',5],['软件工程',5],['中国语言文学',4]],
    [['马克思主义理论',5],['教育学',5],['心理学',5],['中国语言文学',5],['中国史',5],['数学',5],['化学',5],['生物学',5]],
    [['口腔医学',8],['生物学',5],['药学',5],['临床医学',5],['公共卫生与预防医学',5],['生物医学工程',4],['基础医学',4],['心理学',4]],
    [['地质资源与地质工程',5],['交通运输工程',5],['土木工程',4],['测绘科学与技术',4],['机械工程',3],['环境科学与工程',3],['城乡规划学',3],['马克思主义理论',2]],
    [['电子科学与技术',8],['信息与通信工程',7],['计算机科学与技术',6],['机械工程',5],['控制科学与工程',5],['软件工程',5],['光学工程',4],['仪器科学与技术',4]],
]

//重庆
data1=[
    [['机械工程（自定）',6],['仪器科学与技术',6],['电气工程（自定）',6],['法学',5],['数学',5],['材料科学与工程',5],['计算机科学与技术',5],['建筑学',5]],
    [['马克思主义理论',6],['教育学',6],['心理学',6],['中国语言文学',5],['外国语言文学',5],['化学',5],['农业资源与环境',5],['畜牧学',5]]
]

//辽宁
data1=[
    [['交通运输工程',5],['法学',4],['马克思主义理论',4],['计算机科学与技术',4],['船舶与海洋工程',4],['环境科学与工程',4],['信息与通信工程',3],['控制科学与工程',3]],
    [['应用经济学',5],['法学',5],['马克思主义理论',5],['工商管理',5],['理论经济学',4],['哲学',3],['中国语言文学',3],['统计学',3]],
    [['控制科学与工程',7],['材料科学与工程',6],['计算机科学与技术',6],['软件工程',6],['机械工程',6],['冶金工程',5],['矿业工程',5],['管理科学与工程',5]],
    [['机械工程',7],['化学工程与技术',7],['力学',6],['土木工程',6],['环境科学与工程',6],['管理科学与工程',6],['工商管理',6],['数学',6]],
    // [['',],['',],['',],['',],['',],['',],['',],['',]],
    // [['',],['',],['',],['',],['',],['',],['',],['',]],
]

//贵州
data1=[
     [['植物保护（自定）',5],['数学',4],['生物学',4],['机械工程',4],['软件工程',4],['法学',3],['材料科学与工程',3],['计算机科学与技术',3]]
]

//西藏
data1=[
    [['生态学',5],['中国语言文学（藏语言文学）',5],['生态学',4],['中国少数民族语言文学',3],['中国少数民族历史',3],['美术学',3],['音乐学',3],['行政管理',3]]
]

//福建
data1=[
    [['海洋科学',8],['应用经济学',7],['化学',7],['统计学',7],['工商管理',7],['法学',6],['生物学',6],['理论经济学',5]],
    [['化学',6],['管理科学与工程',5],['工商管理',5],['数学',4],['机械工程',4],['土木工程',4],['化学工程与技术',4],['法学',3]]
]

//甘肃
data1=[
    [['草学',8],['生态学',7],['民族学',5],['马克思主义理论',5],['数学',5],['物理学',5],['化学',5],['地理学',5]]
     // [['',],['',],['',],['',],['',],['',],['',],['',]],
    // [['',],['',],['',],['',],['',],['',],['',],['',]],
]

//湖南
data1=[
    [['化学',6],['机械工程',6],['土木工程',6],['工商管理',6],['设计学',6],['应用经济学',5],['马克思主义理论',5],['外国语言文学',5]],
    [['系统科学',8],['计算机科学与技术',8],['软件工程',8],['管理科学与工程',8],['光学工程',7],['信息与通信工程',7],['控制科学与工程',7],['机械工程',6]],
    [['冶金工程',8],['矿业工程',8],['护理学',8],['马克思主义理论',6],['机械工程',6],['材料科学与工程',6],['控制科学与工程',6],['计算机科学与技术',6]],
    [['教育学',5],['外国语言文学',5],['数学',5],['哲学',4],['法学',4],['马克思主义理论',4],['体育学',4],['中国语言文学',4]]
]

//湖北
data1=[
    [['马克思主义理论',7],['教育学',7],['政治学',6],['中国史',6],['心理学',5],['体育学',5],['中国语言文学',5],['数学',5]],
    [['地质学',8],['地质资源与地质工程',8],['环境科学与工程',5],['公共管理',5],['马克思主义理论',4],['海洋科学',4],['计算机科学与技术',4],['土木工程',4]],
    [['机械工程',8],['光学工程',8],['生物医学工程',8],['公共卫生与预防医学',8],['新闻传播学',7],['电气工程',7],['计算机科学与技术',7],['物理学',6]],
    [['园艺学',8],['畜牧学',8],['兽医学',8],['生物学',7],['食品科学与工程',6],['作物学',6],['农林经济管理',6],['风景园林学',6]],
    [['马克思主义理论',8],['地球物理学',8],['测绘科学与技术',8],['图书情报与档案管理',8],['法学',7],['生物学',7],['软件工程',7],['公共管理',7]],
    [['材料科学与工程',8],['马克思主义理论',5],['机械工程',5],['交通运输工程',5],['设计学',5],['应用经济学',4],['信息与通信工程',4],['计算机科学与技术',4]],
    [['应用经济学',6],['法学',6],['统计学',5],['工商管理',5],['公共管理',5],['理论经济学',4],['哲学',2],['马克思主义理论',2]]
]

//海南
data1=[
    [['法学',4],['工商管理',4],['马克思主义理论',3],['信息与通信工程',3],['化学工程与技术',3],['应用经济学',2],['材料科学与工程',2],['食品科学与工程',2]]
]

//浙江
data1=[
    [['生态学',8],['光学工程',8],['控制科学与工程',8],['计算机科学与技术',8],['农业工程',8],['软件工程',8],['园艺学',8],['农业资源与环境',8]]
]

//河南
data1=[
    [['马克思主义理论',5],['考古学',5],['化学',5],['材料科学与工程',5],['水利工程',5],['化学工程与技术',5],['公共管理',5],['法学',4]],
    // [['',],['',],['',],['',],['',],['',],['',],['',]],
]

//河北
data1=[
    [['电气工程（自定）',7],['动力工程及工程热物理',6],['管理科学与工程',5],['工商管理',5],['控制科学与工程',4],['计算机科学与技术',3],['环境科学与工程',3],['软件工程',3]],
    [['控制科学与工程',7],['材料科学与工程',6],['计算机科学与技术',6],['软件工程',6],['机械工程',5],['冶金工程',5],['矿业工程',5],['管理科学与工程',5]],
]

//江西
data1=[
    [['食品科学与工程',7],['新闻传播学',3],['化学',3],['生物学',3],['机械工程',3],['材料科学与工程',3],['化学工程与技术',3],['环境科学与工程',3]]
]

//江苏
data1=[
    [['矿业工程',8],['安全科学与工程',8],['测绘科学与技术',6],['地质资源与地质工程',6],['机械工程',5],['土木工程',5],['化学工程与技术',5],['管理科学与工程',5]],
    [['兵器科学与技术',8],['化学工程与技术',6],['机械工程',5],['光学工程',5],['控制科学与工程',5],['计算机科学与技术',5],['力学',4],['材料科学与工程',4]],
    [['力学',6],['机械工程',6],['管理科学与工程',6],['电气工程',5],['控制科学与工程',5],['计算机科学与技术',5],['航空宇航科学与技术',5],['软件工程',5]],
    [['软件工程',6],['设计学',6],['法学',5],['马克思主义理论',5],['体育学',5],['中国语言文学',5],['外国语言文学',5],['数学',5]],
    [['水利工程',8],['土木工程',6],['环境科学与工程',6],['马克思主义理论',5],['管理科学与工程',5],['工商管理',5],['社会学',4],['力学',4]],
    [['轻工技术与工程',8],['食品科学与工程',8],['设计学',6],['控制科学与工程',5],['化学工程与技术',5],['纺织科学与工程',4],['软件工程',4],['马克思主义理论',3]],
    [['作物学',8],['农业资源与环境',8],['植物保护',8],['农林经济管理',8],['公共管理',7],['食品科学与工程',6],['园艺学',6],['畜牧学',5]],
    [['天文学',8],['地质学',8],['图书情报与档案管理',8],['哲学',7],['社会学',7],['中国语言文学',7],['外国语言文学',7],['中国史',7]],
    [['建筑学',8],['土木工程',8],['交通运输工程',8],['生物医学工程',8],['艺术学理论',8],['电子科学与技术',7],['仪器科学与技术',6],['信息与通信工程',6]],
    [['马克思主义理论',7],['教育学',7],['中国语言文学',5],['外国语言文学',5],['地理学',5],['美术学',5],['法学',4],['心理学',4]],
    [['药学',8],['中药学',5],['中西医结合',3],['工商管理',1],['暂无',0],['暂无',0],['暂无',0],['暂无',0]]

]

//新疆
data1=[
     // [['',],['',],['',],['',],['',],['',],['',],['',]],
    [['中国少数民族语言文学',5],['应用数学',5],['人口资源与环境经济学',4],['专门史',4],['物理化学',4],['动物学',4],['生态学',4],['矿产普查与勘探',4]],
    [['化学工程与技术',4],['农业工程',4],['工商管理',3],['作物学',2],['园艺学',2],['畜牧学',],['基础医学',2],['应用经济学',1]]
]

//广西
data1=[
    [['应用经济学',4],['化学工程与技术',4],['马克思主义理论',3],['生物学',3],['生态学',3],['计算机科学与技术',3],['土木工程',3],['公共管理',3]]
]

//广东
data1=[
    // [['',],['',],['',],['',],['',],['',],['',],['',]],
    [['新闻传播学',6],['应用经济学',5],['中国语言文学',5],['生物学',5],['工商管理',5],['政治学',4],['中国史',4],['计算机科学与技术',4]],
    [['轻工技术与工程',8],['机械工程',6],['材料科学与工程',6],['建筑学',6],['化学工程与技术',6],['环境科学与工程',6],['食品科学与工程',6],['管理科学与工程',6]],
    [['生态学',8],['工商管理',8],['马克思主义理论',7],['公共管理',7],['哲学',6],['中国语言文学',6],['中国史',6],['数学',6]],
    [['心理学',8],['马克思主义理论',6],['教育学',6],['体育学',6],['数学',5],['物理学',5],['中国语言文学',4],['化学',4]],
    [['中西医结合',6],['中医学',5],['中药学',4],['药学',1],['暂无',0],['暂无',0],['暂无',0],['暂无',0]],
    [['兽医学',7],['农业工程',6],['食品科学与工程',6],['畜牧学',6],['农林经济管理',6],['作物学',5],['园艺学',5],['农业资源与环境',5]]
]

//山西
data1=[
    [['机械工程',5],['化学工程与技术',5],['矿业工程',4],['材料科学与工程',3],['电气工程',3],['计算机科学与技术',3],['土木工程',3],['环境科学与工程',3]]
]

//山东
data1=[
    [['海洋科学',8],['水产',8],['生物学',4],['环境科学与工程',4],['食品科学与工程',4],['药学',4],['应用经济学',3],['法学',3]],
    [['数学',8],['马克思主义理论',7],['中国语言文学',7],['应用经济学',6],['外国语言文学',6],['控制科学与工程',6],['药学',6],['工商管理',6]],
    [['数学',8],['马克思主义理论',7],['中国语言文学',7],['应用经济学',6],['外国语言文学',6],['控制科学与工程',6],['药学',6],['工商管理',6]],
    [['机械工程',8],['控制科学与工程',8],['环境科学与工程',8],['力学',7],['材料科学与工程',7],['计算机科学与技术',7],['土木工程',7],['管理科学与工程',7]],
    [['地质资源与地质工程',8],['石油与天然气工程',8],['化学工程与技术',],['安全科学与工程',6],['马克思主义理论',5],['机械工程',4],['动力工程及工程热物理',4],['管理科学与工程',4]]
]

//安徽
data1=[
    // [['',],['',],['',],['',],['',],['',],['',],['',]],
    [['应用经济学',5],['法学',5],['新闻传播学',5],['数学',5],['生态学',5],['统计学',5],['计算机科学与技术',5],['马克思主义理论',4]],
    [['管理科学与工程',7],['马克思主义理论',5],['机械工程',5],['仪器科学与技术',5],['计算机科学与技术',5],['工商管理',5],['材料科学与工程',4],['电气工程',4]],
    [['物理学',8],['化学',8],['天文学',8],['地球物理学',8],['科学技术史',8],['核科学与技术',8],['安全科学与工程',8],['数学',7]],
]

//宁夏
data1=[
    [['民族学',4],['草学',4],['数学',3],['水利工程',3],['中国语言文学',1],['外国语言文学',1],['生物学',1],['生态学',1]]
]

//天津
data1=[
    [['化学工程与技术',8],['机械工程',7],['光学工程',7],['仪器科学与技术',7],['管理科学与工程',7],['力学',6],['材料科学与工程',6],['动力工程及工程热物理',6]],
    [['化学工程与技术',5],['机械工程',4],['材料科学与工程',4],['电气工程',4],['工商管理',4],['控制科学与工程',3],['管理科学与工程',3],['马克思主义理论',3]],
    [['理论经济学',7],['数学',7],['化学',7],['统计学',7],['工商管理',7],['应用经济学',6],['政治学',6],['马克思主义理论',6]],
    [['基础医学',5],['临床医学',4],['药学',4],['护理学',4],['口腔医学',3],['公共卫生与预防医学',3],['中西医结合',3],['生物医学工程',2]],
]

//吉林
data1=[
    // [['',],['',],['',],['',],['',],['',],['',],['',]],
    [['外国语言文学',6],['药学',4],['世界史',3],['化学',2],['生物学',2],['临床医学',2],['中国语言文学',1],['护理学',1]],
    [['马克思主义理论',7],['化学',7],['哲学',6],['法学',6],['政治学',6],['考古学',6],['数学',6],['物理学',6]],
    [['马克思主义理论',8],['教育学',7],['生态学',7],['统计学',7],['世界史',6],['生物学',6],['中国语言文学',5],['外国语言文学',5]],
]

//内蒙古
data1=[
    [['民族学',5],['中国语言文学',5],['生物学',5],['生态学',5],['马克思主义理论',4],['数学',4],['物理学',4],['化学',4]]
]

//云南
data1=[
    [['民族学',8],['生态学',6],['政治学',5],['生物学',5],['理论经济学',4],['中国史',4],['数学',4],['化学',4]]
]

//上海
data1=[
    [['中医学',8],['中西医结合',8],['中药学',8],['暂无',0],['暂无',0],['暂无',0],['暂无',0],['暂无',0]],

    [['化学工程与技术',8],['社会学',5],['化学',5],['材料科学与工程',5],['动力工程及工程热物理',5],['控制科学与工程',5],['环境科学与工程',5],['药学',5]],
    [['哲学',8],['理论经济学',8],['政治学',8],['中国史',8],['数学',8],['马克思主义理论',7],['中国语言文学',7],['新闻传播学',7]],
    [['社会学',6],['美术学',6],['马克思主义理论',5],['新闻传播学',5],['数学',5],['力学',5],['机械工程',5],['材料科学与工程',5]],
    [['教育学',8],['世界史',8],['体育学',7],['中国语言文学',7],['地理学',7],['统计学',7],['软件工程',7],['马克思主义理论',7]],
    [['生物学',8],['机械工程',8],['船舶与海洋工程',8],['临床医学',8],['工商管理',8],['外国语言文学',7],['外国语言文学',7],['数学',7]],
    [['土木工程',8],['环境科学与工程',8],['城乡规划学',8],['管理科学与工程',8],['设计学',7],['数学',6],['机械工程',6],['机械工程',6]],
    [['护理学',8],['基础医学',6],['药学',6],['临床医学',5],['公共卫生与预防医学',5],['中西医结合',4],['公共管理',4],['中药学',2]],
    [['外国语言文学',8],['政治学',5],['新闻传播学',3],['工商管理',3],['中国语言文学',2],['暂无',0],['暂无',0],['暂无',0]],
    [['纺织科学与工程',8],['材料科学与工程',5],['设计学',5],['机械工程',4],['控制科学与工程',4],['环境科学与工程',4],['管理科学与工程',4],['工商管理',4]],
    [['应用经济学',7],['工商管理',7],['统计学',6],['理论经济学',5],['马克思主义理论',5],['法学',4],['管理科学与工程',4],['公共管理',4]],
]

